{
  "act1Intro": {
    "text": [
      "Your head spins, but your body feels a lot worse. Limbs don’t work, lungs can’t breathe, nerves tingle with phantom pain. Then there’s a sudden click in your brain, like a switch turning on, and everything snaps into focus. You can think again.",
      "You lie on the floor, eyes still closed, cheek against cold tiles. It’s then that you hear a muffled chuckle from above you, and you realize that you’re not alone in this room.",
      "You open your eyes.",
      "The room is neat and polished, if a little empty. You tentatively run a hand across your body. Everything seems to be intact. A quick glance around reveals that no one else is in the room. Whose laughter was that, then?",
      "???: A little confused, are we? Don’t worry, the process shouldn’t have made too many alterations in your brain. I tried my best.",
      "The voice comes from an open laptop on a table. The profile of an individual stares back at you, though it’s hard to make out features. The face is washed with static.",
      "You: Where am I?",
      "???:  Hm. I thought I managed to upload that information into your head. Guess some of the data got corrupted.",
      "???: Long story short, you’re in a simulation. Your body’s still in the real world, in front of a computer, but your consciousness is trapped in here. And, sorry to say, you’ll be trapped in here for a while.",
      "You: What do you mean? I still feel real.",
      "???: I’d hope you feel real, otherwise this simulation would be a pretty terrible one. Welcome to V-city.",
      "???: It’s a simulated virtual realm made by the greatest minds of our generation, a place for everybody to exercise freedom in a limitless world, all while living together in harmony. Naturally, that didn’t last long.",
      "???: AveryCorp appeared one day and took over V-city. They took absolute control over our lives, turned it from a dream into a nightmare.",
      "You: AveryCorp?"
    ],
    "BGImage": [
      "story_art/black.png",
      "story_art/black.png",
      "story_art/black.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png"
    ],
    "speaker": [
      null,
      null,
      null,
      null,
      null,
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png"
    ]
  },
  "act1Intro2": {
    "text": [
      "???: Take a look for yourself.",
      "A window makes up one side of the office room; you walk over and look out. The vibrant city glares back at you, a blur of neon against an impassive night sky. It is pretty.",
      "In the distance, there’s a building that stands taller than the others, so large that you can’t help but be drawn to it. It cuts into the sky like a knife, sharp and menacing, with a blazing purple insignia staring down from the top.",
      "A triangle, one that seems all too familiar, yet so wrong. A shiver goes down your spine. What happened here? You take a few deep breaths and turn back to the stranger.",
      "You: What happened to Avery?",
      "???: Avery… something about it changed in the simulation. Creativity, integrity, tenacity, the pillars of the house, replaced by conformity, irreality, and totality. It’s not the people; there’s something more insidious deep inside the core.",
      "You: Insidious? What do you mean?",
      "???: The thing is, AveryCorp is storing something deep inside its vault, and I need your help. We’ve been stuck in this simulation for countless cycles. No matter what we do, we can’t get out and we think it’s because of whatever technology AveryCorp is using.",
      "???: Almost everyone here has resigned themselves to their fate, but I’m still holding out. I think you can get us out of here.",
      "You: Wait, what do you mean, what can I do?",
      "???: I’ll explain that to you later. This is not the most secure place for a conversation. Make your way to the safehouse first. You’ll be able to meet up with the others there. There we can get down to business.",
      "You: Where is this safehouse, exactly?",
      "???: I can’t tell you the location out loud, obviously. As I said, AveryCorp is always listening. We’ve got to play around their rules.",
      "The laptop spits out a data chip of some sort from its side. You tentatively pick it up and inspect it.",
      "???: Here’s a data packet: the coordinates to the safehouse are encoded inside. I trust that you’re skilled enough to decrypt it.",
      "???: There’s a lot of responsibility placed on you. Do your best.",
      "The laptop flickers out, and it’s only then that you realize that you never asked for a name."
    ],
    "BGImage": [
      "story_art/starting_office.png",
      "story_art/window_city.png",
      "story_art/window_city.png",
      "story_art/window_city.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png",
      "story_art/starting_office.png"
    ],
    "speaker": [
      "story_art/char_recruiter.png",
      null,
      null,
      null,
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      null
    ],
    "audio": "AveryCorpTheme.wav"
  },
  "act1MapCorrect": {
    "text": [
      "You find the dark alleyway where the safehouse is located. You punch in the code to open the door and slip inside. The sirens and neon glare of the city streets fade away as the door slides shut behind you.",
      "There’s not much in the safehouse. A single laptop rests on a desk in the middle of the room. As you approach it, it flickers to life, and a glitched face appears. It’s the same glitched silhouette on the monitor.",
      "???: You managed to make it here. Not bad.",
      "You swear that for a moment, the figure smiles. Or maybe not. It could’ve been an artifact on the screen. The figure continues to talk.",
      "???: There’s a lot more work to be done, so I’ll keep this short. I’ve brought you here to join a group with three others. The four of you will have a single task: to bring AveryCorp down.",
      "???: They’re not a megacorporation for nothing. AveryCorp has infinite power, infinite influence. Under normal circumstances, this would be a futile battle. Four random fools forced to fight against the world.",
      "???: But you've only just entered V-city. They wouldn't have had the time to tag and identify you yet, and that gives us a brief window of opportunity.",
      "???: Thankfully, we've found that we don't need a full-scale revolution to bring them down. We've identified our main target inside the corporation.",
      "You: Which is?",
      "???: There’s a file in AveryCorp, locked away in their deepest servers. The few bits of info we’ve managed to obtain suggest that whatever that file contains is keeping this simulation together. If we were to break in and take that file for ourselves, we could have the upper hand.",
      "You: Okay, this isn’t going to be, like, dangerous, right?",
      "???: It is, but I'm afraid you don't have a choice either way. Backing out isn't an option anymore at this point.",
      "???: Leave this safehouse and you’ll no doubt be taken in by AveryCorp within the end of the day, locked in a confinement chamber for interrogation--or worse.",
      "???: Although no clear connection between the cyber identity and the physical brain has been perfectly studied, I assume experiencing the wrath of AveryCorp when they get their hands on you will prove less than beneficial for your mental stability, if not fatal.",
      "You: How do we trust you? Who even are you?",
      "???: Look, if I didn’t need your help I would’ve left you back where I found you to fend for yourself. I know it’s hard to believe a stranger you’ve just met, but I need your help. There’s no one else I can turn to. As for myself, you can call me the Recruiter.",
      "You: Okay then. Guess we're stuck with you for the time being. What’s next?",
      "Recruiter: You’ll need to meet with the others I’ve recruited as well. Head into the next room: they’re waiting for you there.",
      "Recruiter: There’s still some training you need to receive before the mission begins, but you’ve made it this far. Do your best.",
      "The laptop cuts to static. You stand there for a moment, lost in thought, before slowly making your way over to the door at the back."
    ],
    "BGImage": [
      "story_art/outside_safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png",
      "story_art/safehouse.png"
    ],
    "speaker": [
      null,
      null,
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      null
    ]
  },
  "act1MapWrong": {
    "text": [
      "You follow what you think are the indicated coordinates, but you seem to have arrived at a dead end. Maybe you need to take a closer look at the clues.\nHint: The puzzle seems to be showing a number pad. What do the buttons correspond to?"
    ],
    "BGImage": ["story_art/starting_office.png"],
    "speaker": [null]
  }
}
