{
  "act2Intro": {
    "text": [
      "As your group exits the safehouse, you feel a little tingle in the memory module you just installed. Then a voice suddenly speaks in your head. It’s the Recruiter.",
      "Recruiter: Sorry if I alarmed you. The memory module allows me to speak directly into your head. Wouldn’t want you to find a laptop every time we need to chat.",
      "Recruiter: Anyways, looks like you’ve gotten to know each other. Good, you’ll need to place absolute trust in one another if you all want to make it out of here in one piece.",
      "Recruiter: For now, head over to the Night Market Street, just a few blocks down. Look for a place named “The Tea Bar.” Your next contact will be waiting inside.",
      "You: This should be it.",
      "You walk up to the door labeled “The Tea Bar” and look around. The place seems like it’s been out of service for a long time, with boarded up windows and rusted metal grates. Compared to the rest of this vibrant night market, it barely receives a glance from passersby.",
      "As instructed, you tap twice lightly on the window to the right of the door. The camera outside the door suddenly whirs and springs to life, swiveling its gaze onto your group. After a moment’s pause, you hear footsteps approaching the door. A suspicious voice comes through the metal.",
      "???: You the freshlings?",
      "You: I'm sorry?",
      "???: The new ones. Sent by him? The Recruiter?",
      "You: Yeah. That’s us.",
      "???: Come on in then. Wait here while I scan the street to make sure you weren’t followed.",
      "???: Thankfully, doesn’t look like we’re going to have AveryCorp security bots crashing into the place anytime soon.",
      "???: Anyway, nice to meet you. I’m the Contractor.",
      "Contractor: So you’re the new batch of AveryCorp fodder huh? You guys look...",
      "Contractor: Well let’s just say, I’ve seen enough new freshlings to tell which have even the slightest inkling of a chance at success, and you lot, well, I’ll be happy if you make it past the entrance.",
      "Contractor: But we do need every shot we get at this, and I’m sure the Recruiter selected you for a reason, so there must be something behind your bewildered faces.",
      "The contractor clears some space on the middle table revealing what seems to be a contacts list.",
      "Contractor: Let me explain what your job is first. The night market is full of traders, all kinds of lovely folk. They’ll get you what you need for the right payment.",
      "Contractor: In particular, there’s a couple of shadier folk that sell what I’d call more interesting wares. That includes blacklisted information on AveryCorp.",
      "Contractor: Now I’ve made sure to stay connected with some of these traders so that we can get their help when the time comes.",
      "Contractor: Here’s an address list of the people that will provide us with the necessary information and equipment that we’ll need to break into AveryCorp. I’ll mark these on a map for you so you have easy access.",
      "Contractor: I’m warning you though, none of these will be a simple in and out mission. All of them will probably ask you to do something in return for giving you the necessary equipment or intel.",
      "Contractor: I don’t think it’ll take all four of you to visit a single person, but I do recommend pairing up to visit these locations.",
      "Contractor: Now, go. Go meet up with them and meet me back here once you’ve gathered everything."
    ],
    "BGImage": [
      "story_art/outside_safehouse.png",
      "story_art/outside_safehouse.png",
      "story_art/outside_safehouse.png",
      "story_art/outside_safehouse.png",
      "story_art/night_market_street.png",
      "story_art/night_market_street.png",
      "story_art/night_market_street.png",
      "story_art/night_market_street.png",
      "story_art/night_market_street.png",
      "story_art/night_market_street.png",
      "story_art/night_market_street.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png"
    ],
    "speaker": [
      null,
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      null,
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png"
    ]
  },
  "act2BotwBefore": {
    "text": [
      "You: *Knock knock*?",
      "Nothing happens. You hear digital clicks and beeps coming from inside the room, almost as if someone is… playing video games?",
      "You:  Hello, excuse us…",
      "The noises continue, but you can also faintly hear a voice muttering under their breath.",
      "???: Wow, this guy is literally trolling… What is our jungler even doing?... How much harder do I have to carry to win this?",
      "You notice that the door is unlocked. You open it a crack and peer in. A huddled figure sits in front of a computer, frantically typing into a keyboard.",
      "You: Uh… excuse us?",
      "???: My support is going 0/7. It’s actually over…",
      "You cautiously approach the person. They don’t seem to notice. You pull the headphone off their ears.",
      "You: Sorry to intrude…",
      "???: AHHHHHHHHHHHHH!",
      "The figure backs off to a corner and huddles in his blanket. He looks too shocked to even speak, let alone hold a conversation.",
      "You: Sorry for interrupting. We were sent here by the contractor. She told us you’d have something for us.",
      "You see him nervously glancing back and forth between you and the monitors. It seems as though he wants to get back to the game, but is too scared of you to do so.",
      "You: Should we … come back at a later time?",
      "You recognize the faintest hint of a nod.",
      "20 minutes later",
      "The door finally creaks open, and the person from before pokes his head out. His face is a mixture of annoyance and lingering embarrassment.",
      "???: Okay, you can come in now.",
      "You: Hi, sorry for earlier, but we need…",
      "???: I heard you the first time. Thank you for ruining my game, by the way. I would’ve won if it weren’t for you guys.",
      "You: But you were down 18:3…",
      "???: Like you’d know anything about Coalition of Champions, the hit video game by Uprising Games.",
      "???: I was just starting to carry, too. Just needed to take dragon and we would’ve…",
      "???: ...you know what, never mind. Name's Wirehead, and I know you’re here for the code, so take it and leave.",
      "You: The code?",
      "Wirehead: Yeah, the code to access the elevators in AveryCorp. Unless you’re planning to scale the walls?",
      "Wirehead: It’s hidden within that game over there. Link will explain.",
      "You: Link?",
      "Wirehead: From Zelda? Please tell me you are familiar with one of the biggest names in gaming.",
      "You: I’m still confused. I’m supposed to ask a game character for the code?",
      "Wirehead: When I joined the Avery Cyberspace, I brought in a bunch of games with me. Whether it was a glitch in the uploading sequence or something else, a few of my game characters were given a sentient AI.",
      "Wirehead: I hide the data that I collect in these games, and they act as gatekeepers of sorts. Better security than the boring layers of code most hackers have on their data anyway.",
      "You: Wait, how does that make sense?",
      "Wirehead: You’ve really got a lot of questions, huh? Just go talk to him and leave me alone. Or leave my house entirely.",
      "Wirehead: I don’t care whether AveryCorp stands or falls. At least they don’t interrupt me in the middle of a team fight."
    ],
    "BGImage": [
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png",
      "story_art/wirehead_room.png"
    ],
    "speaker": [
      null,
      null,
      null,
      null,
      null,
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      null,
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png",
      "story_art/char_wirehead.png"
    ]
  },
  "act2BotwAfter": {
    "text": [
      "You type in your answer into the game. After a brief moment, the console spits out a data chip for you to pick up. Link waves to you from the screen with a big grin, seemingly wishing you luck.",
      "You turn around, heading towards the exit, and think about expressing your thanks to the figure in the room. You reconsider it, remembering how annoyed he seemed at being disturbed in the first place. You give a slight nod in his way, and exit out through the doors."
    ],
    "BGImage": ["story_art/wirehead_room.png", "story_art/wirehead_room.png"],
    "speaker": [null, null]
  },
  "act2CodeBefore": {
    "text": [
      "You: Hello?",
      "???: Ah! Customers! Come on in.",
      "???: People call me the Techjunkie around here.",
      "Techjunkie: Any gadget you need, I’ve probably got it, and if I don’t, I promise I can cook up just the replacement in no time!",
      "You: Oh, we’re not customers. The contractor sent us in to retrieve something you had?",
      "Techjunkie: You’re not customers?",
      "The sparkle in his eyes fades instantly, replaced by disappointment.",
      "Techjunkie: *mutters* … not even customers … ",
      "Techjunkie: Sent by the contractor eh? Well, I can’t afford to make her mad, even if it means losing a little profit. Come on, we haven’t got all day.",
      "He gestures for you to come further inside the shop.",
      "Techjunkie: The BOBAS are almost ready, just give me a sec to put on the finishing touches.",
      "You: BOBAS?",
      "Techjunkie: Boots Operated By Antimatter Surge. Work of beauty they are. Completely silent, super-easy handling. They’ll come in useful when you’re breaching the outer perimeter.",
      "Techjunkie: Oh right. You asked for the KARAOKE machine too, right? Right. That one’s in the back. I’ll roll it out to the front for you.",
      "You: Um… a karaoke machine?",
      "Techjunkie: No, the KARAOKE machine! Kinetic Action Reaction Adjustment Obfuscation and Korrection Entity. It’ll allow you to mess with the laws of physics here in the virtual world.",
      "Techjunkie: It’s nothing cheap, and the machine itself disintegrates rapidly while using it, so keep it for when you really need it.",
      "You: I thought this simulation was supposed to be realistic.",
      "Techjunkie: Maybe the programmers should have bug-tested a little better, huh? Now stop being dumb and make yourself useful.",
      "Techjunkie: One of my customers, a certain Antonio Rangel, has sent me the drop off location for his package. He encrypted the message and sent it through this old machine, but it doesn’t fit the encryption key I used last time.",
      "Techjunkie: Solve the message, and I’ll think about letting you borrow the BOBAS for your little gig. Any damage comes out of your pocket, okay?"
    ],
    "BGImage": [
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png"
    ],
    "speaker": [
      null,
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png"
    ]
  },
  "act2CodeAfter": {
    "text": [
      "You: We’re all finished. The code is PADDINGTON.",
      "Techjunkie:  Paddington? Hm. What significance might that name hold, I wonder? Well, a promise is a promise, so here you go.",
      "He hands over the BOBAS and the KARAOKE machine.",
      "Techjunkie:  You take care of those babies now. And put ‘em to good use while you're at it. Wouldn’t mind some customer feedback afterwards too, assuming you all make it out alive.",
      "Techjunkie:  Alright, go away now, all of you. You’re scaring off business."
    ],
    "BGImage": [
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png",
      "story_art/techjunkie_store.png"
    ],
    "speaker": [
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png",
      "story_art/char_techjunkie.png"
    ]
  },

  "act2CrosswordBefore": {
    "text": [
      "You: Hello?",
      "???: Go back, I’m busy enough without random Boppers knocking on my door.",
      "You: The Contractor sent us here.",
      "???: Breaking into AveryCorp? Now, why didn’t you say so sooner? Come on in.",
      "???: Name’s Link-r, the fastest Netrunner around town.",
      "Link-r: Any data you need hacked, I can jack myself onto the net and get it for you, as long as the price is right.",
      "Link-r: But if we’re talking about breaking into AveryCorp, well. Let’s just say your guy’s life on the line is pricey enough.",
      "You: So you can help us?",
      "Link-r: Well, I’ll help, but you gotta prove to me that I’m not blowing my hard-earned data on complete nerdlings that aren’t gonna make it through the front gates.",
      "Link-r: I’m going to put you guys through a little test first. Netrunning is all about speed and efficiency.",
      "Link-r: Once you jack yourself in, AveryCorp Intrusions Countermeasures will be all over you if you’re slow. They’ll do anything at all to stop us from dismantling their dictatorship, the least being frying your brains out.",
      "Link-r: Oh, and don’t you think it won’t hurt “cuz it’s all virtual”. You’ll be too scared to even glance at a jacking socket afterwards.",
      "You: Why the high level of security? What is AveryCorp hiding?",
      "Link-r: … …",
      "Link-r: I’ll tell you this, kid. AveryCorp took away our freedom. I’m not just talking about monetary or social freedom.",
      "Link-r: We were robbed of our choice… and I don’t want to be here anymore.",
      "You: … …",
      "Link-r: And that’s why I’m not handing over the AveryCorp security data to some fools, just so that AveryCorp can revamp all their security protocols after a botched break-in. So come over here.",
      "Link-r: What I have here is a cross-word puzzle. Simple enough right? Here’s the catch. You and your partner only get one-half of the clues each.",
      "Link-r: Communicate your clues clearly and efficiently to fill out the crossword puzzle. Both of you should have the crossword filled in completely by the end.",
      "Link-r: Work fast. How fast you finish the puzzle will change my mind on whether I’ll share my data with you."
    ],
    "BGImage": [
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png"
    ],
    "speaker": [
      null,
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png"
    ]
  },
  "act2CrosswordAfter": {
    "text": [
      "Link-r: Hmmm, well, you did better than I’d originally expected. Looks like we've got a good shot at this after all.",
      "Link-r: Here, take this. It’s a firewall program that’ll keep you guys from being instantly detected once you’re within AveryCorp’s walls.",
      "Link-r: No need to thank me. I’ve always wanted to put that program to the test.",
      "Link-r: Good luck. I hope you succeed, for your sake and mine."
    ],
    "BGImage": [
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png",
      "story_art/linkr_office.png"
    ],
    "speaker": [
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png",
      "story_art/char_linkr.png"
    ]
  },
  "act2IDBefore": {
    "text": [
      "The address leads to a dark alleyway, which generally isn’t a good sign. As you step into the shadows, you notice a hooded figure slumped against the wall. They aren’t moving.",
      "You: Hello? You good?",
      "You take another step, and suddenly the figure springs up, hands raised defensively. You still can’t see their face.",
      "???: Stop. Entry. Disallowed. Secrecy. Mandatory.",
      "You: Oh, sorry. Well, we’re here because the recruiter sent us.",
      "???: Acknowledged. You. Require. AveryCorp. Identification.\nObtain. Process. Difficult.\nRequire. Two. Persons.",
      "You: Well, I guess we can do it. What do you need us to do?",
      "???: Forgery. Required. Mole. Inside. AveryCorp. Provide. Legitimate. ID.\nScanning. Of. ID. Prohibited.\nID. Location. Tracked. Physical. Delivery. Also. Impossible.",
      "???: Optic. Transmission. Setup. Complete.\nObserver. View. Describe. Details.\nForger. Listen. Replicate. Every. Facet.",
      "You: Oh, so you’re saying that we’ve established a connection to a mole inside AveryCorp with a valid ID which can’t be scanned or brought out of the compound, so one of us has to look through the mole’s eyes to see the ID and describe to our partner, who is going to be drawing a copy of the ID solely based on verbal description?",
      "???: Affirmative.",
      "You: Why is it so convoluted? Why can’t we just snapshot an image of the ID card while we’re connected to his optical system?",
      "???: Many. Complications. Technology. Intricate. This. Best. Method.",
      "You: But there has to be…",
      "???: No. Retorts. I. Replicator. Best. Black. Market. Dealer. Trust.",
      "You: Okay, fine. Where do we set up?",
      "Replicator: Hijack. Goggles. There.  Forgery. Desk. Here. Divide. Roles.",
      "There’s two devices set up behind him, one resembling a pair of glowing binoculars and the other looking like a miniature 3-D printer."
    ],
    "BGImage": [
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png"
    ],
    "speaker": [
      null,
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png"
    ]
  },
  "act2IDAfter": {
    "text": [
      "The Replicator stares long and hard at the forgery. He doesn’t move a muscle.",
      "You: What do you think?",
      "After a few tense moments, he nods and returns the card to you.",
      "Replicator: Passable. Should. Fool. Systems.",
      "His comment doesn’t reassure you, but he seems satisfied. He half-pushes you back into the light of the main street, staying just a few inches in the shadows.",
      "Replicator: Stay. Safe. Identity. Least. Of. Worries.",
      "With that, the Replicator retreats into the darkness of the alley and vanishes."
    ],
    "BGImage": [
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png",
      "story_art/dark_alleyway.png"
    ],
    "speaker": [
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      "story_art/char_replicator.png",
      null
    ]
  },
  "act2SpotBefore": {
    "text": [
      "???: Stop right there, please! Stay near the entrance. Don’t want you accidentally corrupting any of my data.",
      "You: Oh, hi! We’re here to…",
      "???: The Contractor sent you to pick up a package from me. Yes, I know.",
      "???: I go by the Archivist. Nice to meet you all. Now, if you wouldn’t mind taking a few steps back to give me and my data some space, it would be much appreciated.",
      "You: But there’s nothing here?",
      "Archivist: Nothing here? Nothing here?! Each of the tiles and cylinders in these walls store data that I have accumulated over the many years I’ve been in this place.",
      "Archivist: More importantly, they hold data of our previous memories in Avery, before all this happened… But you don’t need to worry about that.",
      "Archivist: What you need to know is that if you so much as point a finger at anything in this room, you can wave goodbye to my cooperation.",
      "You: Okay, we’ll be careful. Do you have something for us then?",
      "Archivist: Yes, indeed I do. What I have for you is the AveryCorp security scheme and patrol schedule that should aid you in your break-in. Let me tell you now, that was no easy task!",
      "Archivist:  AveryCorp changes their security protocol every 2 days, and gaining access to the correct encryption sequence to predict the next one is… well let’s just say it wouldn’t be possible if I weren’t an excellent data-handler.",
      "You: Right. Gotcha. So, how about you give us that data and we’ll leave you with your data?",
      "Archivist: Tsk tsk tsk. This is the problem with non-data handlers. They think I run a library, willing to lend out knowledge to anybody who strolls in through those doors.",
      "Archivist: Well, here every byte and bit has its own price. And for the data that you seek, I require your labor as there are certain menial data organization tasks that I cannot be bothered to handle.",
      "You: Sure…",
      "Archivist: I recently acquired a set of glyph tablets that are meant to encode a message.",
      "Archivist: However, the amount of information to be gained from them seemed rather insignificant compared to the effort I had to put in to obtain them, so I was waiting for other, less-occupied brains to arrive.",
      "Archivist: Decrypt the meaning of the tablets and I will send you the AveryCorp security details."
    ],
    "BGImage": [
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png"
    ],
    "speaker": [
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png"
    ]
  },
  "act2SpotAfter": {
    "text": [
      "Archivist: Acceptable work, though a little crude in the details. With a bit of practice, I certainly wouldn’t mind having a few of you help tidy up the place one in a while.",
      "Archivist: As long as you refrain from meddling with the more sensitive data, that is.",
      "You wonder how you’d be expected to “tidy up” without being able to touch anything, but you keep quiet. The Archivist hands you a hefty data module.",
      "Archivist: This contains everything you need. Mind that you don’t drop it."
    ],
    "BGImage": [
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png",
      "story_art/archivist_office.png"
    ],
    "speaker": [
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png",
      "story_art/char_datajacker.png"
    ]
  },
  "act2MetaBefore": {
    "text": [
      "Something’s wrong when you return to the Tea Bar. The windows are shattered, the metal door forcibly wrenched open from its hinges.",
      "When your group rushes in, the room is deserted and considerably more roughed up then when you first saw it. The Contractor is nowhere to be found.",
      "The silence is broken by the Recruiter’s voice, once again speaking through your head.",
      "Recruiter: This isn’t good. AveryCorp knows we’re up to something. We need to move. Fast.",
      "You: What do we do? They must’ve taken the Contractor.",
      "Recruiter: Knowing her, she would’ve kept a backup plan, just in case. Search the room. There must be a hidden safe of some sort.",
      "It takes some time, but finally you find something. A hidden chamber underneath the Contractor’s desk. You look inside to find a data chip with a hastily-scribbled note attached to it. You and your team lean in for a closer look.",
      "It seems as though she's left a riddle behind for you to solve. Maybe solving it will grant you access to the data chip?"
    ],
    "BGImage": [
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png",
      "story_art/contractors_office.png"
    ],
    "speaker": [
      null,
      null,
      null,
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      "story_art/char_recruiter.png",
      null,
      null
    ]
  },
  "act2MetaAfter": {
    "text": [
      "You unlock the message the contractor left behind.",
      ">>> RECORDING >>>",
      "Contractor: If you’re watching this, then I’ve probably been captured by AveryCorp. Your situation is probably no safer than mine, so I’ll keep this short.",
      "Contractor: We were planning to take some more time to train you properly before the actual break-in, but now that we’ve been exposed, we’re going to have to accelerate our plans. We are going to proceed with the break-in tonight. They won’t be expecting us to commence with the sabotage right after I’ve been captured.",
      "Contractor: One last thing. The file that you’re looking for, whatever it is stored deep within AveryCorp, it’s dangerous, more than you can imagine. You might be able to find it, if you’re tenacious enough, but controlling it is another matter entirely. Don’t do anything stupid."
    ],
    "BGImage": [
      "story_art/contractors_office.png",
      "story_art/data_tablet.png",
      "story_art/data_tablet.png",
      "story_art/data_tablet.png",
      "story_art/data_tablet.png"
    ],
    "speaker": [
      null,
      null,
      "story_art/char_contractor.png",
      "story_art/char_contractor.png",
      "story_art/char_contractor.png"
    ]
  }
}
